{"glosario":{"slug":"glosario","filePath":"glosario.md","title":"Glosario","links":[],"tags":[],"content":"Antes de empezar a explorar los tutoriales y experimentos de Field Code, vale la pena detenerse un momento en las palabras. La tecnología —como toda cultura— tiene su propio lenguaje. Entenderlo no significa volverse ingeniero o programadora, sino aprender a moverse con soltura en un nuevo campo: el digital.\nEste glosario no busca precisión técnica absoluta, sino ofrecer una puerta de entrada conceptual para antropólogos, investigadores cualitativos y curiosos que quieran incorporar herramientas digitales en su práctica.\n\n🧠 IA (Inteligencia Artificial)\nLa IA es un conjunto de técnicas que permiten que una máquina “aprenda” a realizar tareas que normalmente asociamos con la inteligencia humana: reconocer patrones, generar texto, analizar imágenes, tomar decisiones o conversar.\nNo es una conciencia ni una mente, sino un sistema entrenado con datos que aprende a producir resultados similares a los humanos.\nEn antropología, la IA puede ser vista como objeto de estudio, herramienta y contexto cultural: algo que analizamos, usamos y habitamos al mismo tiempo.\n\n💬 LLM (Large Language Model)\nUn modelo de lenguaje grande es un tipo específico de IA diseñado para trabajar con texto. Aprende a predecir la siguiente palabra en una frase, y de esa manera genera lenguaje.\nModelos como ChatGPT o Claude se entrenan con enormes cantidades de datos textuales y pueden conversar, escribir, resumir, traducir o crear código.\nPodemos pensarlos como colectores de discurso: condensan fragmentos del habla y la escritura humana en un sistema estadístico que “habla” con nosotros.\n\n🔌 API (Application Programming Interface)\nUna API es una interfaz que permite que un programa se comunique con otro. Podríamos imaginarla como un puente entre dos mundos digitales: un canal que permite enviar una solicitud (“quiero esta información”) y recibir una respuesta (“aquí está”). Por ejemplo, si queremos usar ChatGPT desde un script de Python o visualizar datos de Twitter, lo hacemos a través de sus APIs. Para el trabajo etnográfico, las APIs son fuentes y mediaciones: lugares donde circulan los datos que luego analizamos.\n\n💻 Código\nEl código es el lenguaje que usamos para dar instrucciones a las máquinas.\nNo es solo un conjunto de símbolos técnicos: es una forma de escritura con su propia gramática, ritmo y estilo.\nEscribir código puede ser tan interpretativo y creativo como escribir campo o análisis.\nEn Field Code, el código se entiende como un lenguaje etnográfico expandido, que nos permite observar, transformar y narrar el mundo digital.\n\n🧩 Lenguaje de programación\nUn lenguaje de programación es el idioma en el que escribimos código para comunicarnos con una computadora.\nCada lenguaje tiene su estilo, su comunidad y su lógica. Algunos se usan para análisis de datos, otros para arte digital, diseño web o inteligencia artificial.\nAprender un lenguaje no es solo adquirir una técnica: es entrar en una forma particular de pensar y organizar el mundo.\n\n🐍 Python\nPython es un lenguaje de programación muy popular por su claridad y simplicidad.\nSe usa en múltiples áreas: análisis de datos, ciencia, inteligencia artificial, visualización o automatización.\nPara investigadores cualitativos, Python puede ser una herramienta de ampliación del campo: permite procesar textos, analizar redes, generar visualizaciones o experimentar con IA sin necesidad de tener una formación técnica previa.\n\n⚙️ Compilador\nEl compilador (o intérprete) es el programa que traduce el código que escribimos a un lenguaje que la computadora pueda entender y ejecutar.\nImaginémoslo como un traductor simultáneo entre el lenguaje humano y el lenguaje máquina.\nAunque no solemos interactuar directamente con él, está siempre presente, haciendo posible que nuestras líneas de código se transformen en acción.\n\n🌍 Aprender a leer el código del mundo\nEste glosario no pretende agotar los significados de cada término, sino abrir un territorio común para explorarlos desde la práctica. A medida que avancemos en los tutoriales, estas palabras se llenarán de ejemplos, usos y experimentos. Porque el campo —ese espacio donde la antropología observa, escucha y crea— también corre en Python."},"index":{"slug":"index","filePath":"index.md","title":"Bienvenid@ a Field Code","links":[],"tags":[],"content":"Field Code\nIA, código y otras tecnologías para antropólogos\n\nLa antropología siempre ha explorado los márgenes de lo humano: los significados, las prácticas, las relaciones y los sistemas que nos sostienen. Hoy, ese margen se ha movido hacia lo digital. La inteligencia artificial, el código y los datos se han convertido en nuevos territorios etnográficos, pero también en herramientas que pueden transformar nuestra manera de investigar, analizar y crear conocimiento.\nField Code nace como un proyecto de tutoriales semanales sobre la incorporación de herramientas digitales en los flujos de trabajo de los antropólogos e investigadores cualitativos. Aquí encontrarás guías prácticas, experimentos y reflexiones sobre cómo usar la IA, el análisis de datos y la programación para potenciar nuestras prácticas de campo, de análisis y de escritura.\nLa apuesta es clara: desarrollar expertise tecnológica sin perder el corazón etnográfico. Aprender a escribir código sin dejar de escribir sobre lo humano. Navegar la Era de la Inteligencia Artificial sin renunciar a la mirada crítica que caracteriza a la antropología.\n\n🧭 Cada semana compartiré un nuevo tutorial, ejemplo o reflexión.\nEste espacio está pensado para aprender, explorar y hackear la antropología desde el código.\nBienvenid@ a Field Code.\nEl campo sigue abierto, solo que ahora también corre en Python."},"post_1":{"slug":"post_1","filePath":"post_1.md","title":"Genera una clave API de Gemini","links":["glosario"],"tags":[],"content":"En este tutorial vamos a generar una clave de acceso a la API de Gemini. Una clave API es una credencial que nos permite acceder a los productos o servicios de software que una empresa provee. En algunos casos es gratuito y otras veces tiene algún costo. Para este ejemplo, solo aplicaremos a una clave API gratuita. Por último, recuerda anotar siempre tu clave API en algún lugar seguro ya que solo se muestra una sola vez.\nRequisitos\nimport anthropic\n \nclient = anthropic.Anthropic(\n    # defaults to os.environ.get(&quot;ANTHROPIC_API_KEY&quot;)\n    api_key=&quot;my_api_key&quot;,\n)\nmessage = client.messages.create(\n    model=&quot;claude-sonnet-4-5&quot;,\n    max_tokens=1024,\n    messages=[\n        {&quot;role&quot;: &quot;user&quot;, &quot;content&quot;: &quot;Hello, Claude&quot;}\n    ]\n)\nprint(message.content)\n\n  This compatibility layer is primarily intended to test and compare model capabilities, and is not considered a long-term or production-ready solution for most use cases. While we do intend to keep it fully functional and not make breaking changes, our priority is the reliability and effectiveness of the [Claude API](/en/api/overview).\nFor more information on known compatibility limitations, see Important OpenAI compatibility limitations.\nIf you encounter any issues with the OpenAI SDK compatibility feature, please let us know here.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFieldSupport statusmodelUse Claude model namesmax_tokensFully supportedmax_completion_tokensFully supportedstreamFully supportedstream_optionsFully supportedtop_pFully supportedparallel_tool_callsFully supportedstopAll non-whitespace stop sequences worktemperatureBetween 0 and 1 (inclusive). Values greater than 1 are capped at 1.nMust be exactly 1logprobsIgnoredmetadataIgnoredresponse_formatIgnoredpredictionIgnoredpresence_penaltyIgnoredfrequency_penaltyIgnoredseedIgnoredservice_tierIgnoredaudioIgnoredlogit_biasIgnoredstoreIgnoreduserIgnoredmodalitiesIgnoredtop_logprobsIgnoredreasoning_effortIgnored\n\n  Show fields\nTools\ntools[n].function fields\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFieldSupport statusnameFully supporteddescriptionFully supportedparametersFully supportedstrictIgnored\n"}}